In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
dataset=pd.read_csv("Mall_Customers.csv")
dataset.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [6]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 5 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              200 non-null    int64
 1   Genre                   200 non-null    object
 2   Age                     200 non-null    int64
 3   Annual Income (k$)      200 non-null    int64
 4   Spending Score (1-100)  200 non-null    int64
dtypes: int64(4), object(1)
memory usage: 7.9+ KB

In [13]:
dataset.drop(columns=['Genre',"CustomerID","Age"],inplace=True)

In [14]:
dataset.isnull().sum()

Annual Income (k$)        0
Spending Score (1-100)    0
dtype: int64

In [15]:
x=dataset.iloc[:,:2].values

# Modelling

In [16]:
#import 
from sklearn.cluster import DBSCAN

#save
dbs=DBSCAN(eps=2,min_samples=5)

#fit

y_dbs=dbs.fit_predict(x)

In [18]:
dataset["cluster"]=pd.DataFrame(y_dbs)
dataset

     Annual Income (k$)  Spending Score (1-100)  cluster
0                    15                      39       -1
1                    15                      81       -1
2                    16                       6       -1
3                    16                      77       -1
4                    17                      40       -1
..                  ...                     ...      ...
195                 120                      79       -1
196                 126                      28       -1
197                 126                      74       -1
198                 137                      18       -1
199                 137                      83       -1

[200 rows x 3 columns]

In [19]:
dataset["cluster"].unique()

array([-1,  0,  1,  2], dtype=int64)